org/_posts/2022-06-28-qemu-zns-setup.org
#+TITLE: 2022 06 28 QEMU setup ZNS
#+OPTIONS: toc:nil
#+BEGIN_EXPORT html
---
layout: post
title: "Notes: Setup QEMU for ZNS experiments"
excerpt: Notes on setting up QEMU for ZNS experiments
---
#+END_EXPORT

I use QEMU for my VMs, on this page I maintain various notes about how I setup QEMU.
THe configuration is mainly focused on storage aspects, as that is my field of studies.


* Good QEMU sources
- https://www.qemu.org/docs/master/about/index.html is the best source on QEMU as far as I am aware.

* Installing QEMU
I do not recommend installing QEMU from your package manager, if you want to research new hardware/software. In that case, please built QEMU yourself. Additionally, QEMU comes with many configuration parameters, that can be enabled/disabled when you built QEMU yourself. Follow https://www.qemu.org/download/ to get a valid default QEMU installation.

** Using a specific version
It is a good idea to pin a version in QEMU if you want your work to be reproducable. Do this by cloning the QEMU repo.
Then do:
#+BEGIN_SRC bash
git checkout $version # with the correct version signature
#+END_SRC
Also beware, `sudo make install` will install QEMU globally! Do not do this, if you want to use multiple versions (or it is not your own machine...). Instead use aliases or something.

** Interesting configuration parameters
When you want to use a non-standard installation, you should add some parameters to the ./configure command used in the QEMU guide. Some parameters that are interesting:
- --help: shows all possible configurationss :).
- --enable-kvm: ensures that KVM is used (https://www.redhat.com/en/topics/virtualization/what-is-KVM). Might not be necessary, but is generally what you want, especially when benchmarking.
- --disable-gtk: disables the GTK GUI. Many VMs will not need a GUI and using this in a remote environment is problematic.
- --target-list : explicitly sets the targets to built for. Not setting this argument, will built for ALL your targets, probably not something you want. An example target would be 'x86_64-softmmu' to only create the x86_64 target.
- --enable-linux-aio: enables the Linux AIO functionality (https://github.com/littledan/linux-aio). When testing storage tech, please enable.
- --enable-trace-backends=sets the backends to use for tracing in QEMU (see https://qemu.readthedocs.io/en/latest/devel/tracing.html for what backends you might want to use).
- --disable-werror: Disables Werror during compilation. Might be necessary depending on the QEMU version and the compiler/compiler version used.

* Setting up VMs
Setting up a VM in QEMU is not hard, but there are a lot of parameters and functionalities to remember! Some guidelines are useful.

** Creating images
Qemu makes it easy to create emulated devices, such as hard disks and SSDs. For this use the command qemu-img with the necessary arguments. A raw disk device of 32 MB can for example be created with:
#+BEGIN_SRC bash
qemu-img create -f raw NAME.img 32M
#+END_SRC
Then when running the VM, the logic of the image can be defined. In this case NAME.img can for example be used as an NVMe SSD, but also as a NVMe ZNS SSD.
** Running the VM
When running the VM, you should run `qemu-system-<arch>` with `arch` corresponding with the arch of the device running below QEMU (your physical device!). Depending on the privileges and functionalities used, you might need root privileges... For a full example, see for example my personal QEMU config that I used for testing ZNS, https://github.com/Krien/ZNS_personal_Qemu_config. The Gentoo wiki also has a nice explanation at https://wiki.gentoo.org/wiki/QEMU/Options.
