_notes/2022-06-28-qemu-zns-setup.html
---
layout: post
title: "Setup QEMU for ZNS experiments"
short: "Setting up QEMU for ZNS experiments"
category: virtualisation
status: WIP
---

<p>
I use QEMU for my VMs, on this page I maintain various notes about how I setup QEMU.
THe configuration is mainly focused on storage aspects, as that is my field of studies.
</p>


<div id="outline-container-org5c3a505" class="outline-2">
<h2 id="org5c3a505"><span class="section-number-2">1.</span> Good QEMU sources</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://www.qemu.org/docs/master/about/index.html">https://www.qemu.org/docs/master/about/index.html</a> is the best source on QEMU as far as I am aware.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb91677" class="outline-2">
<h2 id="orgdb91677"><span class="section-number-2">2.</span> Installing QEMU</h2>
<div class="outline-text-2" id="text-2">
<p>
I do not recommend installing QEMU from your package manager, if you want to research new hardware/software. In that case, please built QEMU yourself. Additionally, QEMU comes with many configuration parameters, that can be enabled/disabled when you built QEMU yourself. Follow <a href="https://www.qemu.org/download/">https://www.qemu.org/download/</a> to get a valid default QEMU installation.
</p>
</div>

<div id="outline-container-org9ba1e06" class="outline-3">
<h3 id="org9ba1e06"><span class="section-number-3">2.1.</span> Using a specific version</h3>
<div class="outline-text-3" id="text-2-1">
<p>
It is a good idea to pin a version in QEMU if you want your work to be reproducable. Do this by cloning the QEMU repo.
Then do:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">git</span> checkout $<span style="color: #dcaeea;">version</span> <span style="color: #5B6268;"># </span><span style="color: #5B6268;">with the correct version signature</span>
</pre>
</div>
<p>
Also beware, `sudo make install` will install QEMU globally! Do not do this, if you want to use multiple versions (or it is not your own machine&#x2026;). Instead use aliases or something.
</p>
</div>
</div>

<div id="outline-container-orge9a0c02" class="outline-3">
<h3 id="orge9a0c02"><span class="section-number-3">2.2.</span> Interesting configuration parameters</h3>
<div class="outline-text-3" id="text-2-2">
<p>
When you want to use a non-standard installation, you should add some parameters to the ./configure command used in the QEMU guide. Some parameters that are interesting:
</p>
<ul class="org-ul">
<li>&#x2013;help: shows all possible configurationss :).</li>
<li>&#x2013;enable-kvm: ensures that KVM is used (<a href="https://www.redhat.com/en/topics/virtualization/what-is-KVM">https://www.redhat.com/en/topics/virtualization/what-is-KVM</a>). Might not be necessary, but is generally what you want, especially when benchmarking.</li>
<li>&#x2013;disable-gtk: disables the GTK GUI. Many VMs will not need a GUI and using this in a remote environment is problematic.</li>
<li>&#x2013;target-list : explicitly sets the targets to built for. Not setting this argument, will built for ALL your targets, probably not something you want. An example target would be &rsquo;x86<sub>64</sub>-softmmu&rsquo; to only create the x86<sub>64</sub> target.</li>
<li>&#x2013;enable-linux-aio: enables the Linux AIO functionality (<a href="https://github.com/littledan/linux-aio">https://github.com/littledan/linux-aio</a>). When testing storage tech, please enable.</li>
<li>&#x2013;enable-trace-backends=sets the backends to use for tracing in QEMU (see <a href="https://qemu.readthedocs.io/en/latest/devel/tracing.html">https://qemu.readthedocs.io/en/latest/devel/tracing.html</a> for what backends you might want to use).</li>
<li>&#x2013;disable-werror: Disables Werror during compilation. Might be necessary depending on the QEMU version and the compiler/compiler version used.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5992220" class="outline-2">
<h2 id="org5992220"><span class="section-number-2">3.</span> Setting up VMs</h2>
<div class="outline-text-2" id="text-3">
<p>
Setting up a VM in QEMU is not hard, but there are a lot of parameters and functionalities to remember! Some guidelines are useful.
</p>
</div>

<div id="outline-container-orgf228638" class="outline-3">
<h3 id="orgf228638"><span class="section-number-3">3.1.</span> Creating images</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Qemu makes it easy to create emulated devices, such as hard disks and SSDs. For this use the command qemu-img with the necessary arguments. A raw disk device of 32 MB can for example be created with:
</p>
<div class="org-src-container">
<pre class="src src-bash">qemu-img create -f raw NAME.img 32M
</pre>
</div>
<p>
Then when running the VM, the logic of the image can be defined. In this case NAME.img can for example be used as an NVMe SSD, but also as a NVMe ZNS SSD.
</p>
</div>
</div>
<div id="outline-container-org1cf311e" class="outline-3">
<h3 id="org1cf311e"><span class="section-number-3">3.2.</span> Running the VM</h3>
<div class="outline-text-3" id="text-3-2">
<p>
When running the VM, you should run `qemu-system-&lt;arch&gt;` with `arch` corresponding with the arch of the device running below QEMU (your physical device!). Depending on the privileges and functionalities used, you might need root privileges&#x2026; For a full example, see for example my personal QEMU config that I used for testing ZNS, <a href="https://github.com/Krien/ZNS_personal_Qemu_config">https://github.com/Krien/ZNS_personal_Qemu_config</a>. The Gentoo wiki also has a nice explanation at <a href="https://wiki.gentoo.org/wiki/QEMU/Options">https://wiki.gentoo.org/wiki/QEMU/Options</a>.
</p>
</div>
