org/_posts/2022-06-28-qemu-zns-setup.org
*** Architecture options
For info on an arg and its options, set the parameter of the arg to help, such as for the arg `cpu`, `-cpu help`.
Some interesting architecture parameters (that I use):
- -name : sets the name of the VM. When running multiple VMs this is handy. The name will be visible as the `top` process in GNU/Linux. This allows differentiating between the VMs on the host.
- -enable-kvm: gives this VM KVM capabilities. This is necessary to do when you want to use KVM, even when you built QEMU with KVM capabilities! This can also be done with `accel=kvm`, which is apparently more "modern" and support more options. For example setting the `kvm-irqchip` functionalities or the size of the KVMs per vCPUs dirty page ring with `dirty-ring-size=n`.
- -cpu [CPU,...]: allows setting the CPU model (yes really if they are compatible) including CPUID flags. For optimal performance set this to host, which will copy all CPUID flags and CPU configurations from the host. WARNING, if not using host, be sure to use all flags required by the CPU used (such as Meltdown mitigations)! If not done safely, remember what can happen if your VM is compromised and a bug is found leaking out of the VM... In this case you for example combine the type with some extra flags such as: `qemu64,+ssse3,-sse4`. `+` adds a flag and `-` removes a flag. To see what flags are available on the host and on the VM do : `cat /proc/cpuinfo | grep flags` on both of them and compare them. This can also be done to debug if host works correctly for your machine. If NOT setting a CPU, default x86 CPU models will be used such as `qemu64`. This might not be safe and is therefore not recommended... See https://qemu.readthedocs.io/en/latest/system/i386/cpu.html for a more comprehensive guide on the cpu parameter.
- -smp : simulates a SMP system. Generally used to set the number of CPU cores that are available to the VM. such as `-smp 4`. When you want to use all cores do `-smp $(nproc)`. It also supports more advanced options such as setting the number of sockets, cores and threads (https://qemu.readthedocs.io/en/latest/system/invocation.html).
- -m : set to memory that should be available to the VM. Such as `-m 64GB`.
- -net [options]: used for networking (also between host and VM). This is a parameter you probably want to set when not using the GUI as it allows you to ssh into the VM. Do ensure that the VM exposes a port to use. I often use `-net user,hostfwd=tcp::<hostport>-:<vmport>`, which allows accessing services on the guest from the host. Such as sshing into the VM on the host through the host port with for example with `ssh -X user@localhost -p <hostport> -t`. Another good option to add is `-net nic` allowing the network card to be used within the guest (allowing internet access on the guest as well).

  Something that is easy to overlook with QEMU, is the machine type. When using a tool look `virt-manager` this is apparently visible by default, but it is not explicitly shown when only using the terminal (unless a specific request is made). It is generally advisable to always use a specific machine with `-machine ...`, if the VM will have a long lifetime and you want to move the VM to a newer QEMU version. That is because QEMU can use multiple types and the default/available types might change depending on the installation process. This in turn is, as described in https://people.redhat.com/~cohuck/2022/01/05/qemu-machine-types.html, problematic when the VM needs to be migrated later on. As described there, note down the default machine used. When later migrating, explicitly use `-machine ...` with the default of the older variant. At the time of writing (June 2022), `q35` is the most novel machine type to use.

** Loading images and (emulated) devices
Typically you want to make use of images when using QEMU. QEMU can uses `qcow` files for its main disk images. Such images can be simply used with the option `-hda <image>.qcow`, such as an Ubuntu image. When you want to use additional devices, there exist a few different approaches.
*** Emulated devices
To use emulated device (such as created with qemu-img), the commands differ. What the "image" exactly is, depends on the command used. To use the image as an NVMe device use:
#+BEGIN_SRC bash
-drive file="$dev",id=nvme-device,format=raw,if=none #With $dev the name of the .img file
-device "nvme,drive=nvme-device,serial=nvme-dev" # The id should match with the drive id
#+END_SRC
Additionally it is possible to set various NVMe specific arguments, separated by ",", such as the page sizes:
#+BEGIN_SRC bash
-device "nvme,drive=nvme-device,serial=nvme-dev,physical_block_size=4096,logical_block_size=4096"
#+END_SRC
To use a ZNS device use:
#+BEGIN_SRC bash
-drive file="$dev",id=zns-device,format=raw,if=none #With $dev the name of the .img file
-device "nvme,serial=zns-dev,id=nvme1,uuid=5e40ec5f-eeb6-4317-bc5e-c919796a5f79,zoned=true
-device "nvme-ns,drive=zns-device,bus=nvme1,nsid=1" # One for each namespace the device should have
#+END_SRC
Both the device and the namespace device have a unique set of options. Some interesting options for the device itself to set are:
- -mdts: mdts of the SSD
- -zasl: zasl of the SSD (ZNS option)
- -max_ioqpairs: maximum amount of IO qpairs that can be active (parallelism)
Some interesting parameters to set for the namespace:
- -logical_block_size: block size as can be used on the device
- -physical_block_size: the actual block size used in the device
- -zoned.zone_size: zone size in bytes, such as `4M` (ZNS)
- -zoned.zone_capacity: zone capacity in bytes, such as `2M`. ALWAYS set less than zone_size (ZNS)
- -zoned.max_open: maximum number of zones that can be open (ZNS)
- -zoned.max_active: maximum number of zones that can be active (ZNS)
*** Paravirtualisation
It is possible to use paravirtualisation. This shares the device with the host. This allows you to for example use partitions as they are made on the host (partitions are an OS concept, which would make virtualisation otherwise next to impossible). This CAN give a performance overhead and is therefore not preferred. Paravirtualisation can for example be done with:
#+BEGIN_SRC bash
-drive file=/dev/$dev,id=para-device,if=virtio,format=raw # Replace dev with the device to use, such as a partitition.
#+END_SRC
