_notes/2022-06-28-qemu-zns-setup.html
<div id="outline-container-orgf8419e5" class="outline-4">
<h4 id="orgf8419e5"><span class="section-number-4">3.2.1.</span> Architecture options</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
For info on an arg and its options, set the parameter of the arg to help, such as for the arg `cpu`, `-cpu help`.
Some interesting architecture parameters (that I use):
</p>
<ul class="org-ul">
<li>-name : sets the name of the VM. When running multiple VMs this is handy. The name will be visible as the `top` process in GNU/Linux. This allows differentiating between the VMs on the host.</li>
<li>-enable-kvm: gives this VM KVM capabilities. This is necessary to do when you want to use KVM, even when you built QEMU with KVM capabilities! This can also be done with `accel=kvm`, which is apparently more &ldquo;modern&rdquo; and support more options. For example setting the `kvm-irqchip` functionalities or the size of the KVMs per vCPUs dirty page ring with `dirty-ring-size=n`.</li>
<li>-cpu [CPU,&#x2026;]: allows setting the CPU model (yes really if they are compatible) including CPUID flags. For optimal performance set this to host, which will copy all CPUID flags and CPU configurations from the host. WARNING, if not using host, be sure to use all flags required by the CPU used (such as Meltdown mitigations)! If not done safely, remember what can happen if your VM is compromised and a bug is found leaking out of the VM&#x2026; In this case you for example combine the type with some extra flags such as: `qemu64,+ssse3,-sse4`. `+` adds a flag and `-` removes a flag. To see what flags are available on the host and on the VM do : `cat /proc/cpuinfo | grep flags` on both of them and compare them. This can also be done to debug if host works correctly for your machine. If NOT setting a CPU, default x86 CPU models will be used such as `qemu64`. This might not be safe and is therefore not recommended&#x2026; See <a href="https://qemu.readthedocs.io/en/latest/system/i386/cpu.html">https://qemu.readthedocs.io/en/latest/system/i386/cpu.html</a> for a more comprehensive guide on the cpu parameter.</li>
<li>-smp : simulates a SMP system. Generally used to set the number of CPU cores that are available to the VM. such as `-smp 4`. When you want to use all cores do `-smp $(nproc)`. It also supports more advanced options such as setting the number of sockets, cores and threads (<a href="https://qemu.readthedocs.io/en/latest/system/invocation.html">https://qemu.readthedocs.io/en/latest/system/invocation.html</a>).</li>
<li>-m : set to memory that should be available to the VM. Such as `-m 64GB`.</li>
<li><p>
-net [options]: used for networking (also between host and VM). This is a parameter you probably want to set when not using the GUI as it allows you to ssh into the VM. Do ensure that the VM exposes a port to use. I often use `-net user,hostfwd=tcp::&lt;hostport&gt;-:&lt;vmport&gt;`, which allows accessing services on the guest from the host. Such as sshing into the VM on the host through the host port with for example with `ssh -X user@localhost -p &lt;hostport&gt; -t`. Another good option to add is `-net nic` allowing the network card to be used within the guest (allowing internet access on the guest as well).
</p>

<p>
Something that is easy to overlook with QEMU, is the machine type. When using a tool look `virt-manager` this is apparently visible by default, but it is not explicitly shown when only using the terminal (unless a specific request is made). It is generally advisable to always use a specific machine with `-machine &#x2026;`, if the VM will have a long lifetime and you want to move the VM to a newer QEMU version. That is because QEMU can use multiple types and the default/available types might change depending on the installation process. This in turn is, as described in <a href="https://people.redhat.com/~cohuck/2022/01/05/qemu-machine-types.html">https://people.redhat.com/~cohuck/2022/01/05/qemu-machine-types.html</a>, problematic when the VM needs to be migrated later on. As described there, note down the default machine used. When later migrating, explicitly use `-machine &#x2026;` with the default of the older variant. At the time of writing (June 2022), `q35` is the most novel machine type to use.
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7cc353f" class="outline-3">
<h3 id="org7cc353f"><span class="section-number-3">3.3.</span> Loading images and (emulated) devices</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Typically you want to make use of images when using QEMU. QEMU can uses `qcow` files for its main disk images. Such images can be simply used with the option `-hda &lt;image&gt;.qcow`, such as an Ubuntu image. When you want to use additional devices, there exist a few different approaches.
</p>
</div>
<div id="outline-container-org6fb8f80" class="outline-4">
<h4 id="org6fb8f80"><span class="section-number-4">3.3.1.</span> Emulated devices</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
To use emulated device (such as created with qemu-img), the commands differ. What the &ldquo;image&rdquo; exactly is, depends on the command used. To use the image as an NVMe device use:
</p>
<div class="org-src-container">
<pre class="src src-bash">-drive <span style="color: #dcaeea;">file</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">dev</span><span style="color: #98be65;">"</span>,<span style="color: #dcaeea;">id</span>=nvme-device,<span style="color: #dcaeea;">format</span>=raw,<span style="color: #dcaeea;">if</span>=none <span style="color: #5B6268;">#</span><span style="color: #5B6268;">With $dev the name of the .img file</span>
-device <span style="color: #98be65;">"nvme,drive=nvme-device,serial=nvme-dev"</span> <span style="color: #5B6268;"># </span><span style="color: #5B6268;">The id should match with the drive id</span>
</pre>
</div>
<p>
Additionally it is possible to set various NVMe specific arguments, separated by &ldquo;,&rdquo;, such as the page sizes:
</p>
<div class="org-src-container">
<pre class="src src-bash">-device <span style="color: #98be65;">"nvme,drive=nvme-device,serial=nvme-dev,physical_block_size=4096,logical_block_size=4096"</span>
</pre>
</div>
<p>
To use a ZNS device use:
</p>
<div class="org-src-container">
<pre class="src src-bash">-drive <span style="color: #dcaeea;">file</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">dev</span><span style="color: #98be65;">"</span>,<span style="color: #dcaeea;">id</span>=zns-device,<span style="color: #dcaeea;">format</span>=raw,<span style="color: #dcaeea;">if</span>=none <span style="color: #5B6268;">#</span><span style="color: #5B6268;">With $dev the name of the .img file</span>
-device <span style="color: #98be65;">"nvme,serial=zns-dev,id=nvme1,uuid=5e40ec5f-eeb6-4317-bc5e-c919796a5f79,zoned=true</span>
<span style="color: #98be65;">-device "</span>nvme-ns,<span style="color: #dcaeea;">drive</span>=zns-device,<span style="color: #dcaeea;">bus</span>=nvme1,<span style="color: #dcaeea;">nsid</span>=<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">" # One for each namespace the device should have</span>
</pre>
</div>
<p>
Both the device and the namespace device have a unique set of options. Some interesting options for the device itself to set are:
</p>
<ul class="org-ul">
<li>-mdts: mdts of the SSD</li>
<li>-zasl: zasl of the SSD (ZNS option)</li>
<li>-max<sub>ioqpairs</sub>: maximum amount of IO qpairs that can be active (parallelism)</li>
</ul>
<p>
Some interesting parameters to set for the namespace:
</p>
<ul class="org-ul">
<li>-logical<sub>block</sub><sub>size</sub>: block size as can be used on the device</li>
<li>-physical<sub>block</sub><sub>size</sub>: the actual block size used in the device</li>
<li>-zoned.zone<sub>size</sub>: zone size in bytes, such as `4M` (ZNS)</li>
<li>-zoned.zone<sub>capacity</sub>: zone capacity in bytes, such as `2M`. ALWAYS set less than zone<sub>size</sub> (ZNS)</li>
<li>-zoned.max<sub>open</sub>: maximum number of zones that can be open (ZNS)</li>
<li>-zoned.max<sub>active</sub>: maximum number of zones that can be active (ZNS)</li>
</ul>
</div>
</div>
<div id="outline-container-org76979b3" class="outline-4">
<h4 id="org76979b3"><span class="section-number-4">3.3.2.</span> Paravirtualisation</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
It is possible to use paravirtualisation. This shares the device with the host. This allows you to for example use partitions as they are made on the host (partitions are an OS concept, which would make virtualisation otherwise next to impossible). This CAN give a performance overhead and is therefore not preferred. Paravirtualisation can for example be done with:
</p>
<div class="org-src-container">
<pre class="src src-bash">-drive <span style="color: #dcaeea;">file</span>=/dev/$<span style="color: #dcaeea;">dev</span>,<span style="color: #dcaeea;">id</span>=para-device,<span style="color: #dcaeea;">if</span>=virtio,<span style="color: #dcaeea;">format</span>=raw <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Replace dev with the device to use, such as a partitition.</span>
</pre>
</div>
</div>
</div>
