org/_posts/2022-06-28-qemu-zns-setup.org
*** Passthrough
It is also possible to use real devices with QEMU passthrough. This gives a real device to the VM to use and makes the device not usable on the host anymore. So be careful! To do this, do in order (on the host):
#+BEGIN_SRC bash
trid=`ls -l /sys/block/$dev/device/device | awk '{split($11,dev,"/"); print dev[4]}'` # With dev the device to passthrough
# If the above does not work, which it might, do simply and copy the string at the end, the numeric part that is.
# and put it in the variable trid. This variable is important to remember.
ls -l /sys/block/$dev/device/device
# Now we will unbind the device
echo $trid > /sys/bus/pci/drivers/nvme/unbind # might need to use `| sudo tee` or run as root with `sudo -i`.
#+END_SRC
The following step depends on the state of the machine. If since the startup, you have already binded this device to vfio-pci you will need a different command. If not, do:
#+BEGIN_SRC bash
modprobe vfio-pci
lspci -n -s $trid
# ^ This should return two numbers at the end, separated by a ":" such as xxxx:yyyy. Those are the vendor id and device id
# Rebind to vfio
echo <xxxx> <yyyy> > /sys/bus/pci/drivers/vfio-pci/new_id # With xxxx and yyyy the numbers just retrieved
#+END_SRC
However, if you had binded at some point in time. Do (as the device is already known):
#+BEGIN_SRC bash
echo $trid > /sys/bus/pci/drivers/vfio-pci/bind
#+END_SRC
Now we can use it in QEMU with the extra parameter:
#+BEGIN_SRC bash
-device vfio-pc,host=$trid
#+END_SRC
When the device needs to be used on the host again, we can do:
#+BEGIN_SRC bash
echo $trid > /sys/bus/pci/drivers/vfio-pci/unbind # Unbind from vfio.
echo $trid > /sys/bus/pci/drivers/nvme/bind       # Rebind
#+END_SRC
* Dealing with NUMA
Some computers come with NUMA, this complicates the setup and is something you need to be aware of when using NUMA. Especially when using benchmarks. You do not want excessive communication between NUMA nodes. Therefore, it is beneficial/advisable to just run your QEMU on just one NUMA node. First check if you even have NUMA:
#+BEGIN_SRC bash
lscpu | grep NUMA
#+END_SRC
Then do an investigation of hardware to get the NUMA configuration:
#+BEGI_SRC bash
numactl -H
#+END_SRC
If using passthrough hardware it is important to make sure that the node you use for your VM and the hardware match. For SSDs verify the node with:
#+BEGIN_SRC bash
cat /sys/class/nvme/$dev/numa_node      # With dev the device you want to use
cat /sys/bus/pci/devices/$id/numa_node  # Should even work when bound to vfio, provided you know the PCI_ID
#+END_SRC
Generally if the device (for NVMe SSDs default) uses MSIX_IRQ instead of legacy IRQ, this might be done correctly automatically. Else also ensure that the interrupts of the device are on the same NUMA node. Can be tested as follows:
#+BEGIN_SRC bash
cat /sys/class/nvme/$dev/device/irq 		# Get legacy IRQ associated with device. Might not be useful as it is legacy!
ls /sys/class/nvme/$dev/device/msi_irqs 	# Get msix IRQs. This is probably what you need,
# since kernel version v4.8 https://github.com/torvalds/linux/commit/90c9712fbb388077b5e53069cae43f1acbb0102a.

# or

lscpu                  # Note down to what NUMA node a CPU is assigned (this is needed to associate an interrupt to a NUMA node)
cat /proc/interrupts   # Since you already know to what NUMA a CPU is assigned, you already know the interrupt mapping.
#+END_SRC
This should show what CPU currently is handling the IRQs (we know what CPU is assigned to what node with numactl -H). Ideally this should be equal to the affinity of CPUs on the node we will use. However, for more information we also want the affinity list of the irq. To get the affinity of the irq, do the following:
#+BEGIN_SRC bash
cat /proc/irq/$num/smp_affinity_list		# We want this to be the same as the NUMA nodes we will use on the VM
#+END_SRC
If they are not on the same NUMA node, we might have a problem. Generally, it is the case that the interrupts are assigned to the lower CPUs such as CPU0. If MSI_X is used (which we want for fast devices), we have a problem if we do need to set the affinity, see https://serverfault.com/questions/1052448/how-can-i-override-irq-affinity-for-nvme-devices. In the case that I tested, affinity was properly set, but as MSI_X was used I could not test the alternative. Technically, MSI_X can be turned of, but this has signifcant drawbacks... It might therefore, not be a fair comparison. This post clarifies (answer by Simon Richter), that it should perform optimal when using passthrough by default.

Then once we know the NUMA node, we can run:
#+BEGIN_SRC bash
numactl -C $cpus -N $num -m $num qemu-system-<arch>... # cpus, are the cpus we want to use (if we want to use less than one NUMA node), num is the NUMA node number used for the storage
#+END_SRC
If using less than one NUMA, beware of interrupts still existing on other CPUS with passhtrough, even when setting -C! numactl mainly focuses on the qemu instance, not the device!

During runtime, we can debug if mainly one node is used with:
#+BEGIN_SRC bash
numastat -c qemu-system-<arch>
#+END_SRC
We can also test that the device is still assigned to the same NUMA node when the VM uses passthrough with:
#+BEGIN_SRC bash
cat /proc/interrupts | grep vfio
#+END_SRC
