_notes/2022-06-28-qemu-zns-setup.html
<div id="outline-container-orgdd00894" class="outline-4">
<h4 id="orgdd00894"><span class="section-number-4">3.3.3.</span> Passthrough</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
It is also possible to use real devices with QEMU passthrough. This gives a real device to the VM to use and makes the device not usable on the host anymore. So be careful! To do this, do in order (on the host):
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #dcaeea;">trid</span>=<span style="color: #51afef; font-weight: bold;">`</span><span style="color: #51afef; font-weight: bold;">ls</span><span style="color: #51afef; font-weight: bold;"> -l /sys/block/$dev/device/device | awk '{split($11,dev,"/"); print dev[4]}'`</span> <span style="color: #5B6268;"># </span><span style="color: #5B6268;">With dev the device to passthrough</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">If the above does not work, which it might, do simply and copy the string at the end, the numeric part that is.</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">and put it in the variable trid. This variable is important to remember.</span>
<span style="color: #ECBE7B;">ls</span> -l /sys/block/$<span style="color: #dcaeea;">dev</span>/device/device
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Now we will unbind the device</span>
<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">trid</span> &gt; /sys/bus/pci/drivers/nvme/unbind <span style="color: #5B6268;"># </span><span style="color: #5B6268;">might need to use `| </span><span style="color: #5B6268;">sudo</span><span style="color: #5B6268;"> tee` or run as root with `</span><span style="color: #5B6268;">sudo</span><span style="color: #5B6268;"> -i`.</span>
</pre>
</div>
<p>
The following step depends on the state of the machine. If since the startup, you have already binded this device to vfio-pci you will need a different command. If not, do:
</p>
<div class="org-src-container">
<pre class="src src-bash">modprobe vfio-pci
lspci -n -s $<span style="color: #dcaeea;">trid</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">^ This should return two numbers at the end, separated by a ":" such as xxxx:yyyy. Those are the vendor id and device id</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Rebind to vfio</span>
<span style="color: #ECBE7B;">echo</span> &lt;xxxx&gt; &lt;yyyy&gt; &gt; /sys/bus/pci/drivers/vfio-pci/new_id <span style="color: #5B6268;"># </span><span style="color: #5B6268;">With xxxx and yyyy the numbers just retrieved</span>
</pre>
</div>
<p>
However, if you had binded at some point in time. Do (as the device is already known):
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">trid</span> &gt; /sys/bus/pci/drivers/vfio-pci/bind
</pre>
</div>
<p>
Now we can use it in QEMU with the extra parameter:
</p>
<div class="org-src-container">
<pre class="src src-bash">-device vfio-pc,<span style="color: #dcaeea;">host</span>=$<span style="color: #dcaeea;">trid</span>
</pre>
</div>
<p>
When the device needs to be used on the host again, we can do:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">trid</span> &gt; /sys/bus/pci/drivers/vfio-pci/unbind <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Unbind from vfio.</span>
<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">trid</span> &gt; /sys/bus/pci/drivers/nvme/bind       <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Rebind</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org548ec0b" class="outline-2">
<h2 id="org548ec0b"><span class="section-number-2">4.</span> Dealing with NUMA</h2>
<div class="outline-text-2" id="text-4">
<p>
Some computers come with NUMA, this complicates the setup and is something you need to be aware of when using NUMA. Especially when using benchmarks. You do not want excessive communication between NUMA nodes. Therefore, it is beneficial/advisable to just run your QEMU on just one NUMA node. First check if you even have NUMA:
</p>
<div class="org-src-container">
<pre class="src src-bash">lscpu | <span style="color: #ECBE7B;">grep</span> NUMA
</pre>
</div>
<p>
Then do an investigation of hardware to get the NUMA configuration:
#+BEGI<sub>SRC</sub> bash
numactl -H
#+END<sub>SRC</sub>
If using passthrough hardware it is important to make sure that the node you use for your VM and the hardware match. For SSDs verify the node with:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">cat</span> /sys/class/nvme/$<span style="color: #dcaeea;">dev</span>/numa_node      <span style="color: #5B6268;"># </span><span style="color: #5B6268;">With dev the device you want to use</span>
<span style="color: #ECBE7B;">cat</span> /sys/bus/pci/devices/$<span style="color: #dcaeea;">id</span>/numa_node  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Should even work when bound to vfio, provided you know the PCI_ID</span>
</pre>
</div>
<p>
Generally if the device (for NVMe SSDs default) uses MSIX<sub>IRQ</sub> instead of legacy IRQ, this might be done correctly automatically. Else also ensure that the interrupts of the device are on the same NUMA node. Can be tested as follows:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">cat</span> /sys/class/nvme/$<span style="color: #dcaeea;">dev</span>/device/irq         <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Get legacy IRQ associated with device. Might not be useful as it is legacy!</span>
<span style="color: #ECBE7B;">ls</span> /sys/class/nvme/$<span style="color: #dcaeea;">dev</span>/device/msi_irqs     <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Get msix IRQs. This is probably what you need,</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">since kernel version v4.8 https://github.com/torvalds/linux/commit/90c9712fbb388077b5e53069cae43f1acbb0102a.</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">or</span>

lscpu                  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Note down to what NUMA node a CPU is assigned (this is needed to associate an interrupt to a NUMA node)</span>
<span style="color: #ECBE7B;">cat</span> /proc/interrupts   <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Since you already know to what NUMA a CPU is assigned, you already know the interrupt mapping.</span>
</pre>
</div>
<p>
This should show what CPU currently is handling the IRQs (we know what CPU is assigned to what node with numactl -H). Ideally this should be equal to the affinity of CPUs on the node we will use. However, for more information we also want the affinity list of the irq. To get the affinity of the irq, do the following:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">cat</span> /proc/irq/$<span style="color: #dcaeea;">num</span>/smp_affinity_list        <span style="color: #5B6268;"># </span><span style="color: #5B6268;">We want this to be the same as the NUMA nodes we will use on the VM</span>
</pre>
</div>
<p>
If they are not on the same NUMA node, we might have a problem. Generally, it is the case that the interrupts are assigned to the lower CPUs such as CPU0. If MSI<sub>X</sub> is used (which we want for fast devices), we have a problem if we do need to set the affinity, see <a href="https://serverfault.com/questions/1052448/how-can-i-override-irq-affinity-for-nvme-devices">https://serverfault.com/questions/1052448/how-can-i-override-irq-affinity-for-nvme-devices</a>. In the case that I tested, affinity was properly set, but as MSI<sub>X</sub> was used I could not test the alternative. Technically, MSI<sub>X</sub> can be turned of, but this has signifcant drawbacks&#x2026; It might therefore, not be a fair comparison. This post clarifies (answer by Simon Richter), that it should perform optimal when using passthrough by default.
</p>

<p>
Then once we know the NUMA node, we can run:
</p>
<div class="org-src-container">
<pre class="src src-bash">numactl -C $<span style="color: #dcaeea;">cpus</span> -N $<span style="color: #dcaeea;">num</span> -m $<span style="color: #dcaeea;">num</span> qemu-system-&lt;arch&gt;... <span style="color: #5B6268;"># </span><span style="color: #5B6268;">cpus, are the cpus we want to use (if we want to use </span><span style="color: #5B6268;">less</span><span style="color: #5B6268;"> than one NUMA node), num is the NUMA node number used for the storage</span>
</pre>
</div>
<p>
If using less than one NUMA, beware of interrupts still existing on other CPUS with passhtrough, even when setting -C! numactl mainly focuses on the qemu instance, not the device!
</p>

<p>
During runtime, we can debug if mainly one node is used with:
</p>
<div class="org-src-container">
<pre class="src src-bash">numastat -c qemu-system-&lt;arch&gt;
</pre>
</div>
<p>
We can also test that the device is still assigned to the same NUMA node when the VM uses passthrough with:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">cat</span> /proc/interrupts | <span style="color: #ECBE7B;">grep</span> vfio
</pre>
</div>
</div>
</div>
